/**
 * @file User.h 
 * @author Pop_Cat (xuzhicheng@longshuo-tech.com)
 * @brief  
 * @version 0.0.0.24.11.08
 * @date 2025年09月18日
 * 
 * 
 */
#ifndef _USER_H_
#define _USER_H_

#ifdef __cplusplus
extern "C" {
#endif

/* -------------------------------------------------------------------------------------------------------------------------- */
/* 头文件引用 */
/* -------------------------------------------------------------------------------------------------------------------------- */
#include "General_Type.h"
#include "MCU.h"

/* -------------------------------------------------------------------------------------------------------------------------- */
/* 宏定义 - 通用 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 宏定义 - 配置 */
/* -------------------------------------------------------------------------------------------------------------------------- */
#define USER_TEST_ENABLE    ( 0 )
#define USER_SCR_LR_DEFAULT ( true )
/* -------------------------------------------------------------------------------------------------------------------------- */
/* 类型定义 */
/* -------------------------------------------------------------------------------------------------------------------------- */

/** 模式类型 */
typedef enum {
    Mode_None = 0x00 , ///< 无模式
    Mode_Sys_Init ,
    Mode_Sys_Charge ,


    
    Mode_Single ,   ///< 单次测距模式
    Mode_Continue , ///< 连续测距模式
    Mode_Area , ///< 面积模式 
    Mode_Volume ,   ///< 体积模式 
    Mode_Hight_Pythagorean , ///< 高度模式 - 勾股定理 
    Mode_Hight_Sum_Pythagorean , ///< 高度和模式 - 勾股定理 
    Mode_Hight_Minus_Pythagorean ,   ///< 高度差模式 - 勾股定理 
    Mode_Hight_Sin ,   ///< 高度模式 - sin函数模式 
    Mode_Hight_Sum_Sin ,   ///< 高度和模式 - sin函数模式 
    Mode_Hight_Minus_Sin , ///< 高度差模式 - sin函数模式 
    Mode_Menu , ///< 菜单模式 
    Mode_Storage ,  ///< 存储模式 
    Mode_Angle_Ruler ,  ///< 角度尺模式
    Mode_Angle_Level ,  ///< 角度水平模式
    Mode_Angle_Ruler_Cut , ///< 角度尺裁剪模式
    Mode_Angle_Ruler_Cut_Single ,   ///< 角度尺裁剪单次模式
    Mode_Angle_Ruler_Cut_Mitter ,   ///< 角度尺裁剪米尺模式
    Mode_Angle_Ruler_Memory , ///< 角度尺记忆模式
    Mode_Valid
} Mode_t ;

typedef struct {
    Mode_t Mode ;
    Mode_t Mode_Last ;
    Mode_t Mode_Storage ;

    bool Scr_LR ; ///< 屏幕左右翻转
} User_t ;

/* -------------------------------------------------------------------------------------------------------------------------- */
/* 外部变量引用声明 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 静态对象定义 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 函数声明 - 功能 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 函数声明 - 回调 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 函数声明 - 接口 */
/* -------------------------------------------------------------------------------------------------------------------------- */
void User_Main( void );

void User_Mode_Turn( Mode_t Mode );
Mode_t User_Mode_Get( void );

void User_SCR_LR_Turn( void );
bool User_SCR_LR_Get( void );

void User_Data_Save( void );
void User_Data_Load( void );

void User_Fac_LD_Offset_Save( void );
void User_Fac_LD_Offset_Load( void );

void User_Fac_LD_Multy_Point_Save( void );
void User_Fac_LD_Multy_Point_Load( void );

void User_Fac_Angle_Six_Save( void );
void User_Fac_Angle_Six_Load( void );

void User_Fac_Angle_Level_Save( void );
void User_Fac_Angle_Level_Load( void );

void User_Fac_AngRemap_Save( void );
void User_Fac_AngRemap_Load( void );

#if USER_TEST_ENABLE
void Run_All_User_Tests(void);
#endif
#ifdef __cplusplus
}
#endif

#endif
