/**
 * @file Power.h
 * @author Pop_Cat (xuzhicheng@longshuo-tech.com)
 * @brief 
 * @version 0.0.0.24.11.08
 * @date 2025年09月18日
 * 
 * 
 */

/* -------------------------------------------------------------------------------------------------------------------------- */
/* 头文件引用 */
/* -------------------------------------------------------------------------------------------------------------------------- */
#include "stdint.h"
#include "stdbool.h"
#include "Tick.h"

/* -------------------------------------------------------------------------------------------------------------------------- */
/* 私有宏定义 */
/* -------------------------------------------------------------------------------------------------------------------------- */
#define PWR_ENV_TEMP_MIN    ( -50 ) 
#define PWR_ENV_TEMP_MAX    ( 100 )

/* 电池任务调用间隔 */
#define PWR_TASK_INTERVAL  ( 20 )   /* ms */

/* 电压缓冲区的大小 */
#define PWR_BAT_VOLTAGE_BUFF_SIZE   ( 15 )

/* 环境温度缓冲区大小 */
#define PWR_ENV_TEMP_BUFF_SIZE  ( 15 )

/* 满电格数 */
#define PWR_BAT_LEVEL_MAX   ( 3 )   /* 格 */

/* 满电电压 */
#define PWR_BAT_VOLTAGE_FULL    ( 4.2 ) /* V */

/* 截止电压 */
#define PWR_CUT_OFF_VOLTAGE   ( Battery_Level_Map[ 0 ] ) /* V */

/* 充电插入检测阈值 */
#define PWR_CHARGE_INSERT_THRESHOLD   ( 100 ) /* ms */

/* 充电错误检测时间阈值 */
#define PWR_CHARGE_ERROR_THRESHOLD   ( 60 ) /* ms */

/* 充电芯片输出检测时间阈值 */
#define PWR_CHARGE_CHIP_OUTPUT_THRESHOLD   ( 60 ) /* ms */


/* 充电高温外内阈值 */
#define PWR_CHARGE_HIGH_TEMP_OUT    ( 38.0f )   /* ℃ */
#define PWR_CHARGE_HIGH_TEMP_IN     ( 36.5f )   /* ℃ */

/* 充电低温外内阈值 */
#define PWR_CHARGR_LOW_TEMP_IN  ( 3.5f )   /* ℃ */
#define PWR_CHARGE_LOW_TEMP_OUT ( 2.0f )   /* ℃ */

/* 使用高温外内阈值 */
#define PWR_USING_HIGH_TEMP_OUT    ( 38.0f )   /* ℃ */
#define PWR_USING_HIGH_TEMP_IN     ( 36.5f )   /* ℃ */

/* 使用低温外内阈值 */
#define PWR_USING_LOW_TEMP_IN  ( 3.5f )   /* ℃ */
#define PWR_USING_LOW_TEMP_OUT ( 2.0f )   /* ℃ */


/* 使用状态 、 充电状态 */
#define BAT_STATE_CHANGE_TH_DEFALT  ( 100 )    /* 电池状态变化阈值 - 常规状态 */

/* 充电完成状态、 高低温状态 */
#define BAT_STATE_CHANGE_TH_SPECIAL  ( 500 )    /* 电池状态变化阈值 - 特殊状态 */

/* 电池状态引脚初始化采样次数 */
#define BAT_STATE_PIN_INIT_SAMPLE_TIMES  ( 20 )      /* 电池状态引脚初始化采样次数 */

/* -------------------------------------------------------------------------------------------------------------------------- */
/* 内部函数声明 */
/* -------------------------------------------------------------------------------------------------------------------------- */




/* -------------------------------------------------------------------------------------------------------------------------- */
/* 私有类型定义 */
/* -------------------------------------------------------------------------------------------------------------------------- */



/* -------------------------------------------------------------------------------------------------------------------------- */
/* 类型定义 */
/* -------------------------------------------------------------------------------------------------------------------------- */
/* 复位原因类型 */
typedef enum {
    Reset_Watch_Dog ,   /* 看门狗复位 */
    Reset_Dowload , /* 下载供电复位 */
    Reset_Charging ,    /* 充电复位 */
    Reset_Key_Power_On ,    /* 按键开机复位 */
    Reset_Low_Voltage ,   /* 低电压开机复位 */
    Reset_Unkonw    /* 未知原因复位 */
} Reset_t ;

/* 电池状态  */
typedef enum {
    Bstate_Using ,  /* 放电使用中 */
    Bstate_Charge ,     /* 正常充电中 */
    Bstate_Charge_High_TEMP ,  /* 充电温度过高 */
    Bstate_Charge_Low_TEMP ,    /* 充电温度过低 */
    Bstate_Charge_Complete  /* 充电完成 */
} Bat_State_t ;

/* -------------------------------------------------------------------------------------------------------------------------- */
/* 外部变量引用声明 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 文件作用域对象 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 只读数据 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 函数声明 - 功能 */
/* -------------------------------------------------------------------------------------------------------------------------- */

void Power_Init( void );
void Power_Task_Handler( void );

#define Power_ON    Power_Port_Set_Power_Hold_State( true )
#define Power_OFF   Power_Port_Set_Power_Hold_State( false )

Reset_t Power_Get_Reset( void );

bool Power_Get_Bat_State( Bat_State_t * State );

bool Power_Get_Bat_Level( uint8_t * Level );
bool Power_Get_Bat_Voltage( float * Voltage );

bool Power_Get_Env_Temp( float * Tempture );
int8_t Power_Get_Env_Temp_State( void );

bool Power_Get_Charge_Insert( void );
/* -------------------------------------------------------------------------------------------------------------------------- */
/* 函数声明 - 回调 */
/* -------------------------------------------------------------------------------------------------------------------------- */


/* -------------------------------------------------------------------------------------------------------------------------- */
/* 函数声明 - 接口 */
/* -------------------------------------------------------------------------------------------------------------------------- */
void Power_Port_Power_Reset_Periph_Init( void );
void Power_Port_Other_Peripheral_Init( void );


void Power_Port_Set_Charge_Control_State( bool Enable );
void Power_Port_Set_Power_Hold_State( bool State );

bool Power_Port_Get_Power_On_Key_State( void );
float Power_Port_Get_Bat_Voltage( void );
float Power_Port_Get_Env_Tempture( void );


bool Power_Port_Get_Charge_Insert( void );
bool Power_Port_Get_Charge_Error( void );
bool Power_Port_Get_Charge_Output( void );
